; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob76) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate8)
	(at pallet1 distributor0)
	(clear crate6)
	(at pallet2 distributor1)
	(clear crate2)
	(at truck0 distributor1)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 337)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 380)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 39)
	(at crate1 distributor1)
	(on crate1 pallet2)
	(= (weight crate1) 36)
	(at crate2 distributor1)
	(on crate2 crate1)
	(= (weight crate2) 95)
	(at crate3 depot0)
	(on crate3 pallet0)
	(= (weight crate3) 73)
	(at crate4 depot0)
	(on crate4 crate3)
	(= (weight crate4) 13)
	(at crate5 distributor0)
	(on crate5 crate0)
	(= (weight crate5) 98)
	(at crate6 distributor0)
	(on crate6 crate5)
	(= (weight crate6) 96)
	(at crate7 depot0)
	(on crate7 crate4)
	(= (weight crate7) 99)
	(at crate8 depot0)
	(on crate8 crate7)
	(= (weight crate8) 29)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate3)
		(on crate1 crate0)
		(on crate2 pallet0)
		(on crate3 pallet2)
		(on crate4 crate2)
		(on crate6 pallet1)
		(on crate8 crate1)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist0 crate8 crate7 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate7)
   added: (lifting hoist0 crate8) (clear crate7)
   changed: (fuel-cost) from 0 to 1
   goals met: 0 of 7
2. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 1 to 11
   goals met: 0 of 7
3. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 29
   goals met: 0 of 7
4. (lift hoist2 crate2 crate1 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist2) (on crate2 crate1)
   added: (lifting hoist2 crate2) (clear crate1)
   changed: (fuel-cost) from 11 to 12
   goals met: 0 of 7
5. (lift hoist0 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate4)
   added: (lifting hoist0 crate7) (clear crate4)
   changed: (fuel-cost) from 12 to 13
   goals met: 0 of 7
6. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 29 to 128
   goals met: 0 of 7
7. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 13 to 23
   goals met: 0 of 7
8. (load hoist2 crate2 truck0 distributor1)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck0) (available hoist2)
   changed: (current_load truck0) from 128 to 223
   goals met: 0 of 7
9. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 23 to 24
   goals met: 0 of 7
10. (drop hoist2 crate1 pallet2 distributor1)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 pallet2)
   goals met: 0 of 7
11. (unload hoist2 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck0) from 223 to 194
   goals met: 0 of 7
12. (lift hoist1 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate5)
   added: (lifting hoist1 crate6) (clear crate5)
   changed: (fuel-cost) from 24 to 25
   goals met: 0 of 7
13. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   changed: (current_load truck1) from 0 to 96
   goals met: 0 of 7
14. (lift hoist1 crate5 crate0 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist1) (on crate5 crate0)
   added: (lifting hoist1 crate5) (clear crate0)
   changed: (fuel-cost) from 25 to 26
   goals met: 0 of 7
15. (load hoist1 crate5 truck1 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck1) (available hoist1)
   changed: (current_load truck1) from 96 to 194
   goals met: 0 of 7
16. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 26 to 27
   goals met: 0 of 7
17. (load hoist1 crate0 truck1 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck1) (available hoist1)
   changed: (current_load truck1) from 194 to 233
   goals met: 0 of 7
18. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 27 to 37
   goals met: 0 of 7
19. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 37 to 47
   goals met: 0 of 7
20. (unload hoist1 crate6 truck1 distributor0)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   changed: (current_load truck1) from 233 to 137
   goals met: 0 of 7
21. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 47 to 57
   goals met: 0 of 7
22. (drop hoist1 crate6 pallet1 distributor0)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 distributor0) (clear crate6) (on crate6 pallet1)
   goals met: 1 of 7
23. (drop hoist2 crate8 crate1 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate1)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate1)
   goals met: 2 of 7
24. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 137 to 98
   goals met: 2 of 7
25. (load hoist2 crate0 truck0 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck0) (available hoist2)
   changed: (current_load truck0) from 194 to 233
   goals met: 2 of 7
26. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 57 to 67
   goals met: 2 of 7
27. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   changed: (fuel-cost) from 67 to 68
   goals met: 2 of 7
28. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   changed: (current_load truck0) from 233 to 246
   goals met: 2 of 7
29. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 246 to 151
   goals met: 2 of 7
30. (drop hoist0 crate2 crate3 depot0)
   deleted: (lifting hoist0 crate2) (clear crate3)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 crate3)
   goals met: 2 of 7
31. (lift hoist0 crate2 crate3 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 crate3)
   added: (lifting hoist0 crate2) (clear crate3)
   changed: (fuel-cost) from 68 to 69
   goals met: 2 of 7
32. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 151 to 246
   goals met: 2 of 7
33. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   changed: (fuel-cost) from 69 to 70
   goals met: 2 of 7
34. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   changed: (current_load truck0) from 246 to 319
   goals met: 2 of 7
35. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 70 to 80
   goals met: 2 of 7
36. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck0) from 319 to 246
   goals met: 2 of 7
37. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 80 to 90
   goals met: 2 of 7
38. (unload hoist0 crate2 truck0 depot0)
   deleted: (in crate2 truck0) (available hoist0)
   added: (lifting hoist0 crate2)
   changed: (current_load truck0) from 246 to 151
   goals met: 2 of 7
39. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 90 to 100
   goals met: 2 of 7
40. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 3 of 7
41. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 100 to 110
   goals met: 3 of 7
42. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   changed: (current_load truck0) from 151 to 138
   goals met: 3 of 7
43. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 110 to 120
   goals met: 3 of 7
44. (drop hoist0 crate4 crate2 depot0)
   deleted: (lifting hoist0 crate4) (clear crate2)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate2)
   goals met: 4 of 7
45. (drop hoist2 crate3 crate8 distributor1)
   deleted: (lifting hoist2 crate3) (clear crate8)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 crate8)
   goals met: 4 of 7
46. (unload hoist2 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck0) from 138 to 99
   goals met: 4 of 7
47. (load hoist2 crate0 truck1 distributor1)
   deleted: (lifting hoist2 crate0)
   added: (in crate0 truck1) (available hoist2)
   changed: (current_load truck1) from 98 to 137
   goals met: 4 of 7
48. (lift hoist2 crate3 crate8 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist2) (on crate3 crate8)
   added: (lifting hoist2 crate3) (clear crate8)
   changed: (fuel-cost) from 120 to 121
   goals met: 4 of 7
49. (load hoist2 crate3 truck1 distributor1)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   changed: (current_load truck1) from 137 to 210
   goals met: 4 of 7
50. (lift hoist2 crate8 crate1 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate1)
   added: (lifting hoist2 crate8) (clear crate1)
   changed: (fuel-cost) from 121 to 122
   goals met: 3 of 7
51. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 210 to 239
   goals met: 3 of 7
52. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   changed: (fuel-cost) from 122 to 123
   goals met: 3 of 7
53. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   changed: (current_load truck1) from 239 to 275
   goals met: 3 of 7
54. (unload hoist2 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist2)
   added: (lifting hoist2 crate3)
   changed: (current_load truck1) from 275 to 202
   goals met: 3 of 7
55. (drop hoist2 crate3 pallet2 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 pallet2)
   goals met: 4 of 7
56. (unload hoist2 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist2)
   added: (lifting hoist2 crate0)
   changed: (current_load truck1) from 202 to 163
   goals met: 4 of 7
57. (drop hoist2 crate0 crate3 distributor1)
   deleted: (lifting hoist2 crate0) (clear crate3)
   added: (available hoist2) (at crate0 distributor1) (clear crate0) (on crate0 crate3)
   goals met: 5 of 7
58. (unload hoist2 crate1 truck1 distributor1)
   deleted: (in crate1 truck1) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck1) from 163 to 127
   goals met: 5 of 7
59. (drop hoist2 crate1 crate0 distributor1)
   deleted: (lifting hoist2 crate1) (clear crate0)
   added: (available hoist2) (at crate1 distributor1) (clear crate1) (on crate1 crate0)
   goals met: 6 of 7
60. (unload hoist2 crate8 truck1 distributor1)
   deleted: (in crate8 truck1) (available hoist2)
   added: (lifting hoist2 crate8)
   changed: (current_load truck1) from 127 to 98
   goals met: 6 of 7
61. (drop hoist2 crate8 crate1 distributor1)
   deleted: (lifting hoist2 crate8) (clear crate1)
   added: (available hoist2) (at crate8 distributor1) (clear crate8) (on crate8 crate1)
   goals met: 7 of 7
